src/Enums/ВидыОперацийРасходСоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходСоСчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыНаПлатежныеКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеНаличных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПродажиВКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссияБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашейОрганизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийРасходИзКассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходИзКассы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеВКассуККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличнымиВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашейОрганизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийПоступлениеВКассу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеВКассу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничнаяВыручка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничнаяВыручкаСуммовойУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаймаСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНаличныхВБанке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтНашейОрганизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийПоступлениеНаСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеНаСчет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаймаСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоКартам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличными</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводСДругогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтКурьерскойКомпанииПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтНашейОрганизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийПлатежноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПлатежноеПоручение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ФормыДокументовДеньгиКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция - Проверяет является ли переданная форма документом Расход со счета
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ЭтоРасходСоСчета(Форма) Экспорт

	Возврат ТипДокументаСтрокой(Форма) = "РасходСоСчета";

КонецФункции

// Функция - Проверяет является ли переданная форма документом Расход из кассы
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ЭтоРасходИзКассы(Форма) Экспорт

	Возврат ТипДокументаСтрокой(Форма) = "РасходИзКассы";

КонецФункции

// Функция - Проверяет является ли переданная форма документом Поступление на счет
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ЭтоПоступлениеНаСчет(Форма) Экспорт

	Возврат ТипДокументаСтрокой(Форма) = "ПоступлениеНаСчет";

КонецФункции

// Функция - Проверяет является ли переданная форма документом Поступление в кассу
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ЭтоПоступлениеВКассу(Форма) Экспорт

	Возврат ТипДокументаСтрокой(Форма) = "ПоступлениеВКассу";

КонецФункции

// Функция - Проверяет является ли переданная форма документом Платежное поручение
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ЭтоПлатежноеПоручение(Форма) Экспорт

	Возврат ТипДокументаСтрокой(Форма) = "ПлатежноеПоручение";

КонецФункции

// Функция - Проверяет является ли переданная форма документом Операция по платежным картам
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ЭтоОперацияПоПлатежнымКартам(Форма) Экспорт

	Возврат ТипДокументаСтрокой(Форма) = "ОперацияПоПлатежнымКартам";

КонецФункции

// Функция - Проверяет является ли переданная форма банковским документом
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ЭтоДокументПоБанку(Форма) Экспорт

	Возврат ЭтоРасходСоСчета(Форма) ИЛИ ЭтоПоступлениеНаСчет(Форма);

КонецФункции

// Функция - Проверяет является ли переданная форма кассовым документом
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ЭтоДокументПоКассе(Форма) Экспорт

	Возврат ЭтоРасходИзКассы(Форма) ИЛИ ЭтоПоступлениеВКассу(Форма);

КонецФункции

// Функция - Возвращает строковое предстовление типа документа
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Строка - Строковое представление типа документа
//
Функция ТипДокументаСтрокой(Форма) Экспорт
	
	Если ТипЗнч(Форма) = Тип("Строка") Тогда
		ИмяФормыМассив = СтрРазделить(Форма, ".", Ложь);
	Иначе
		ИмяФормыМассив = СтрРазделить(Форма.ИмяФормы, ".", Ложь);
	КонецЕсли;
	
	Если ИмяФормыМассив.Количество() >=2 Тогда
		Возврат ИмяФормыМассив[1];
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Функция - Проверяет используется ли договор в переданном виде операции
//
// Параметры:
//  ВидОперации       - Перечисления.ВидыОперацийПлатежноеПоручение
//                    - Перечисления.ВидыОперацийПоступлениеВКассу
//                    - Перечисления.ВидыОперацийПоступлениеНаСчет
//                    - Перечисления.ВидыОперацийРасходИзКассы
//                    - Перечисления.ВидыОперацийРасходСоСчета
//                    - Перечисления.ВидыОперацийЭквайринга
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ВидОперацииБезДоговора(ВидОперации) Экспорт
	
	Возврат ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ВозвратЗаймаСотрудником")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.РасчетыПоКредитам")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Зарплата")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.РасчетыПоКредитам");
	
КонецФункции

// Функция - Проверяет используется расшифровка платежа в переданном виде операции
//
// Параметры:
//  ВидОперации       - Перечисления.ВидыОперацийПлатежноеПоручение
//                    - Перечисления.ВидыОперацийПоступлениеВКассу
//                    - Перечисления.ВидыОперацийПоступлениеНаСчет
//                    - Перечисления.ВидыОперацийРасходИзКассы
//                    - Перечисления.ВидыОперацийРасходСоСчета
//                    - Перечисления.ВидыОперацийЭквайринга
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ВидОперацииБезРасшифровки(ВидОперации) Экспорт
	
	Возврат ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Зарплата")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Зарплата")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Зарплата")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога");
	
КонецФункции

// Функция - Проверяет относится ли переданный вид операции к личным средствам предпринимателя
//
// Параметры:
//  ВидОперации       - Перечисления.ВидыОперацийПлатежноеПоручение
//                    - Перечисления.ВидыОперацийПоступлениеВКассу
//                    - Перечисления.ВидыОперацийПоступлениеНаСчет
//                    - Перечисления.ВидыОперацийРасходИзКассы
//                    - Перечисления.ВидыОперацийРасходСоСчета
//                    - Перечисления.ВидыОперацийЭквайринга
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ВидОперацииЛичныеСредстваПредпринимателя(ВидОперации) Экспорт
	
	Возврат ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ЛичныеСредстваПредпринимателя")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.ЛичныеСредстваПредпринимателя")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ЛичныеСредстваПредпринимателя")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ЛичныеСредстваПредпринимателя")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ЛичныеСредстваПредпринимателя");
	
КонецФункции

// Функция - Проверяет относится ли переданный вид операции к прочим расчетам
//
// Параметры:
//  ВидОперации       - Перечисления.ВидыОперацийПлатежноеПоручение
//                    - Перечисления.ВидыОперацийПоступлениеВКассу
//                    - Перечисления.ВидыОперацийПоступлениеНаСчет
//                    - Перечисления.ВидыОперацийРасходИзКассы
//                    - Перечисления.ВидыОперацийРасходСоСчета
//                    - Перечисления.ВидыОперацийЭквайринга
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ВидОперацииПрочиеРасчеты(ВидОперации) Экспорт
	
	Возврат ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.ПрочиеРасчеты")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ПрочиеРасчеты")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПрочиеРасчеты");
	
КонецФункции

// Функция - Проверяет учитывается ли в налоговом учете переданный вид операции
//
// Параметры:
//  ВидОперации       - Перечисления.ВидыОперацийПлатежноеПоручение
//                    - Перечисления.ВидыОперацийПоступлениеВКассу
//                    - Перечисления.ВидыОперацийПоступлениеНаСчет
//                    - Перечисления.ВидыОперацийРасходИзКассы
//                    - Перечисления.ВидыОперацийРасходСоСчета
//                    - Перечисления.ВидыОперацийЭквайринга
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ВидОперацииУчитываетсяВНУ(ВидОперации) Экспорт
	
	Возврат 	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Поставщику")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.НашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Покупателю")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Налоги")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ВозвратПродажиВКредит")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Прочее")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.НаРасходы")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ЗарплатаСотруднику")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Зарплата")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Поставщику")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.НашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Покупателю")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Налоги")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Прочее")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.НаРасходы")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.ПрочиеРасчеты")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Зарплата")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПоставщика")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.Налоги")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКредитам")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.Прочее")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтНашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтПокупателя")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтНашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтПоставщика")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.Прочее")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ПрочиеРасчеты");
	
КонецФункции

// Функция - Проверяет может ли использоваться патент в переданном виде операции
//
// Параметры:
//  ВидОперации       - Перечисления.ВидыОперацийПлатежноеПоручение
//                    - Перечисления.ВидыОперацийПоступлениеВКассу
//                    - Перечисления.ВидыОперацийПоступлениеНаСчет
//                    - Перечисления.ВидыОперацийРасходИзКассы
//                    - Перечисления.ВидыОперацийРасходСоСчета
//                    - Перечисления.ВидыОперацийЭквайринга
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ВидОперацииПатент(ВидОперации) Экспорт
	
	Возврат 	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКредитам")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.Прочее")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтНашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтПокупателя")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтНашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.Прочее")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ПрочиеРасчеты");
	
КонецФункции

// Функция - Проверяет может ли использоваться НДС в переданном виде операции
//
// Параметры:
//  ВидОперации       - Перечисления.ВидыОперацийПлатежноеПоручение
//                    - Перечисления.ВидыОперацийПоступлениеВКассу
//                    - Перечисления.ВидыОперацийПоступлениеНаСчет
//                    - Перечисления.ВидыОперацийРасходИзКассы
//                    - Перечисления.ВидыОперацийРасходСоСчета
//                    - Перечисления.ВидыОперацийЭквайринга
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ВидОперацииНДС(ВидОперации) Экспорт
	
	Возврат 	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Покупателю")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Поставщику")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.НашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПоставщика")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтНашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтПокупателя")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтПоставщика")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтНашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.РозничнаяВыручка")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.РозничнаяВыручкаСуммовойУчет")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Покупателю");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
